# Terraform environment prod
#### Format and Style 🖌`success`
#### Initialization ⚙️`success`
#### Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Plan 📖`success`

<details><summary>Show Plan</summary>

```

[Lines containing Refreshing state removed]
[Truncated to 120000 bytes! See logoutput for complete plan]
Acquiring state lock. This may take a few moments...
data.azuread_application_published_app_ids.well_known: Reading...
data.azuread_client_config.current: Reading...
data.azuread_client_config.current: Read complete after 0s [id=cd0026d8-283b-4a55-9bfa-d0ef4a8ba21c-f03f7579-5f39-4d7f-bcea-8e5cb6d7aca4-02b17d28-7ec8-4084-92ce-d26051fa4998]
data.azuread_application_published_app_ids.well_known: Read complete after 0s [id=appIds]
data.azuread_directory_object.current: Reading...
data.azuread_directory_object.current: Read complete after 0s [id=/directoryObjects/02b17d28-7ec8-4084-92ce-d26051fa4998]
data.azuread_service_principal.msgraph: Reading...
data.azuread_service_principal.msgraph: Read complete after 1s [id=/servicePrincipals/b9d7b3d8-a063-4e34-89d9-15db56e22d42]
data.azuread_service_principal.current[0]: Reading...
data.azuread_service_principal.current[0]: Read complete after 0s [id=/servicePrincipals/02b17d28-7ec8-4084-92ce-d26051fa4998]
data.azurerm_role_definition.contributor: Reading...
data.azurerm_subscription.current: Reading...
data.azurerm_role_definition.storage_blob_data_owner: Reading...
data.azurerm_role_definition.reader: Reading...
data.azurerm_role_definition.azure_kubernetes_service_cluster_user_role: Reading...
data.azurerm_role_definition.storage_blob_reader_data_access: Reading...
data.azurerm_role_definition.contributor: Read complete after 0s [id=/providers/Microsoft.Authorization/roleDefinitions/b24988ac-6180-42a0-ab88-20f7382dd24c]
data.azurerm_resource_group.tfstate: Reading...
data.azurerm_role_definition.storage_blob_data_owner: Read complete after 0s [id=/providers/Microsoft.Authorization/roleDefinitions/b7e6dc6d-f1e8-4753-8033-0f276bb0955b]
data.azurerm_role_definition.user_access_administrator: Reading...
data.azurerm_role_definition.reader: Read complete after 0s [id=/providers/Microsoft.Authorization/roleDefinitions/acdd72a7-3385-48ef-bd42-f606fba81ae7]
data.azurerm_role_definition.azure_kubernetes_service_cluster_user_role: Read complete after 0s [id=/providers/Microsoft.Authorization/roleDefinitions/4abbcc35-e782-43d8-92c5-2d3f1bd2253f]
data.azurerm_subscription.current: Read complete after 0s [id=/subscriptions/d43d5057-8389-40d5-88c4-04db9275cbf2]
data.azurerm_role_definition.storage_blob_reader_data_access: Read complete after 0s [id=/providers/Microsoft.Authorization/roleDefinitions/c12c1c16-33a1-487b-954d-41c89c60f349]
data.azurerm_role_definition.user_access_administrator: Read complete after 0s [id=/providers/Microsoft.Authorization/roleDefinitions/18d7d88d-d35e-4fb5-a5c3-7773c20a72d9]
data.azurerm_resource_group.tfstate: Read complete after 0s [id=/subscriptions/d43d5057-8389-40d5-88c4-04db9275cbf2/resourceGroups/terraform-rg]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # azuread_application.product["pac-altinn-altinn-notifications-dev"] will be created
  + resource "azuread_application" "product" {
      + app_role_ids                = (known after apply)
      + client_id                   = (known after apply)
      + disabled_by_microsoft       = (known after apply)
      + display_name                = "GitHub: altinn/altinn-notifications - Dev"
      + id                          = (known after apply)
      + logo_url                    = (known after apply)
      + oauth2_permission_scope_ids = (known after apply)
      + object_id                   = (known after apply)
      + prevent_duplicate_names     = false
      + publisher_domain            = (known after apply)
      + sign_in_audience            = "AzureADMyOrg"
      + tags                        = (known after apply)
      + template_id                 = (known after apply)
    }

  # azuread_application.product["pac-altinn-altinn-notifications-prod"] will be created
  + resource "azuread_application" "product" {
      + app_role_ids                = (known after apply)
      + client_id                   = (known after apply)
      + disabled_by_microsoft       = (known after apply)
      + display_name                = "GitHub: altinn/altinn-notifications - Prod"
      + id                          = (known after apply)
      + logo_url                    = (known after apply)
      + oauth2_permission_scope_ids = (known after apply)
      + object_id                   = (known after apply)
      + prevent_duplicate_names     = false
      + publisher_domain            = (known after apply)
      + sign_in_audience            = "AzureADMyOrg"
      + tags                        = (known after apply)
      + template_id                 = (known after apply)
    }

  # azuread_application.reader will be updated in-place
  ~ resource "azuread_application" "reader" {
        id                             = "/applications/f2259af8-0975-4e83-925f-3ccdf18da571"
        tags                           = []
        # (14 unchanged attributes hidden)

      - required_resource_access {
          - resource_app_id = "00000003-0000-0000-c000-000000000000" -> null

          - resource_access {
              - id   = "9a5d68dd-52b0-4cc2-bd40-abcf44ac3a30" -> null
              - type = "Role" -> null
            }
          - resource_access {
              - id   = "5b567255-7703-4780-807c-7be8301ae99b" -> null
              - type = "Role" -> null
            }
        }

        # (6 unchanged blocks hidden)
    }

  # azuread_application_api_access.example_msgraph will be created
  + resource "azuread_application_api_access" "example_msgraph" {
      + api_client_id  = "00000003-0000-0000-c000-000000000000"
      + application_id = "/applications/005b1c70-6fa7-4205-9fa1-8b7a53713238"
      + id             = (known after apply)
      + role_ids       = [
          + "1bfefb4e-e0b5-418b-a88f-73c46d2cc8e9",
          + "62a82d76-70ea-41e2-9197-370581804d09",
        ]
    }

  # azuread_application_federated_identity_credential.oidc_branch["pac-altinn-altinn-notifications-dev"] will be created
  + resource "azuread_application_federated_identity_credential" "oidc_branch" {
      + application_id = (known after apply)
      + audiences      = [
          + "api://AzureADTokenExchange",
        ]
      + credential_id  = (known after apply)
      + description    = "Allow GitHub actions run within the context of branch 'main' from the repository https://github.com/Altinn/altinn-notifications to have access to the app registration"
      + display_name   = "github.Altinn.altinn-notifications.branch.main"
      + id             = (known after apply)
      + issuer         = "https://token.actions.githubusercontent.com"
      + subject        = "repo:Altinn/altinn-notifications:ref:refs/heads/main"
    }

  # azuread_application_federated_identity_credential.oidc_branch["pac-altinn-altinn-notifications-prod"] will be created
  + resource "azuread_application_federated_identity_credential" "oidc_branch" {
      + application_id = (known after apply)
      + audiences      = [
          + "api://AzureADTokenExchange",
        ]
      + credential_id  = (known after apply)
      + description    = "Allow GitHub actions run within the context of branch 'main' from the repository https://github.com/Altinn/altinn-notifications to have access to the app registration"
      + display_name   = "github.Altinn.altinn-notifications.branch.main"
      + id             = (known after apply)
      + issuer         = "https://token.actions.githubusercontent.com"
      + subject        = "repo:Altinn/altinn-notifications:ref:refs/heads/main"
    }

  # azuread_application_federated_identity_credential.oidc_branch["pac-altinn-altinn-receipt-dev"] must be replaced
-/+ resource "azuread_application_federated_identity_credential" "oidc_branch" {
      ~ credential_id  = "6fce3e08-3f4c-4a02-b254-8111f210a69f" -> (known after apply)
      ~ description    = "Allow GitHub actions run within the context of branch 'main' from the repository https://github.com/altinn/altinn-receipt to have access to the app registration" -> "Allow GitHub actions run within the context of branch 'main' from the repository https://github.com/Altinn/altinn-receipt to have access to the app registration"
      ~ display_name   = "github.altinn.altinn-receipt.branch.main" -> "github.Altinn.altinn-receipt.branch.main" # forces replacement
      ~ id             = "a9890518-647e-4298-ba54-3aa86ffb0fb5/federatedIdentityCredential/6fce3e08-3f4c-4a02-b254-8111f210a69f" -> (known after apply)
      ~ subject        = "repo:altinn/altinn-receipt:ref:refs/heads/main" -> "repo:Altinn/altinn-receipt:ref:refs/heads/main"
        # (3 unchanged attributes hidden)
    }

  # azuread_application_federated_identity_credential.oidc_branch["pac-altinn-altinn-receipt-prod"] must be replaced
-/+ resource "azuread_application_federated_identity_credential" "oidc_branch" {
      ~ credential_id  = "00c26dcd-e860-4f47-873e-7092be63fc47" -> (known after apply)
      ~ description    = "Allow GitHub actions run within the context of branch 'main' from the repository https://github.com/altinn/altinn-receipt to have access to the app registration" -> "Allow GitHub actions run within the context of branch 'main' from the repository https://github.com/Altinn/altinn-receipt to have access to the app registration"
      ~ display_name   = "github.altinn.altinn-receipt.branch.main" -> "github.Altinn.altinn-receipt.branch.main" # forces replacement
      ~ id             = "fe5b68b8-d39c-4672-9797-6d02aa556647/federatedIdentityCredential/00c26dcd-e860-4f47-873e-7092be63fc47" -> (known after apply)
      ~ subject        = "repo:altinn/altinn-receipt:ref:refs/heads/main" -> "repo:Altinn/altinn-receipt:ref:refs/heads/main"
        # (3 unchanged attributes hidden)
    }

  # azuread_application_federated_identity_credential.oidc_environments["pac-altinn-altinn-notifications-dev-at21"] will be created
  + resource "azuread_application_federated_identity_credential" "oidc_environments" {
      + application_id = (known after apply)
      + audiences      = [
          + "api://AzureADTokenExchange",
        ]
      + credential_id  = (known after apply)
      + description    = "Allow GitHub actions run within the context of environment 'at21' from the repository https://github.com/Altinn/altinn-notifications to have access to the app registration"
      + display_name   = "github.Altinn.altinn-notifications.environment.at21"
      + id             = (known after apply)
      + issuer         = "https://token.actions.githubusercontent.com"
      + subject        = "repo:Altinn/altinn-notifications:environment:at21"
    }

  # azuread_application_federated_identity_credential.oidc_environments["pac-altinn-altinn-notifications-dev-at22"] will be created
  + resource "azuread_application_federated_identity_credential" "oidc_environments" {
      + application_id = (known after apply)
      + audiences      = [
          + "api://AzureADTokenExchange",
        ]
      + credential_id  = (known after apply)
      + description    = "Allow GitHub actions run within the context of environment 'at22' from the repository https://github.com/Altinn/altinn-notifications to have access to the app registration"
      + display_name   = "github.Altinn.altinn-notifications.environment.at22"
      + id             = (known after apply)
      + issuer         = "https://token.actions.githubusercontent.com"
      + subject        = "repo:Altinn/altinn-notifications:environment:at22"
    }

  # azuread_application_federated_identity_credential.oidc_environments["pac-altinn-altinn-notifications-dev-at23"] will be created
  + resource "azuread_application_federated_identity_credential" "oidc_environments" {
      + application_id = (known after apply)
      + audiences      = [
          + "api://AzureADTokenExchange",
        ]
      + credential_id  = (known after apply)
      + description    = "Allow GitHub actions run within the context of environment 'at23' from the repository https://github.com/Altinn/altinn-notifications to have access to the app registration"
      + display_name   = "github.Altinn.altinn-notifications.environment.at23"
      + id             = (known after apply)
      + issuer         = "https://token.actions.githubusercontent.com"
      + subject        = "repo:Altinn/altinn-notifications:environment:at23"
    }

  # azuread_application_federated_identity_credential.oidc_environments["pac-altinn-altinn-notifications-dev-at24"] will be created
  + resource "azuread_application_federated_identity_credential" "oidc_environments" {
      + application_id = (known after apply)
      + audiences      = [
          + "api://AzureADTokenExchange",
        ]
      + credential_id  = (known after apply)
      + description    = "Allow GitHub actions run within the context of environment 'at24' from the repository https://github.com/Altinn/altinn-notifications to have access to the app registration"
      + display_name   = "github.Altinn.altinn-notifications.environment.at24"
      + id             = (known after apply)
      + issuer         = "https://token.actions.githubusercontent.com"
      + subject        = "repo:Altinn/altinn-notifications:environment:at24"
    }

  # azuread_application_federated_identity_credential.oidc_environments["pac-altinn-altinn-notifications-dev-at25"] will be created
  + resource "azuread_application_federated_identity_credential" "oidc_environments" {
      + application_id = (known after apply)
      + audiences      = [
          + "api://AzureADTokenExchange",
        ]
      + credential_id  = (known after apply)
      + description    = "Allow GitHub actions run within the context of environment 'at25' from the repository https://github.com/Altinn/altinn-notifications to have access to the app registration"
      + display_name   = "github.Altinn.altinn-notifications.environment.at25"
      + id             = (known after apply)
      + issuer         = "https://token.actions.githubusercontent.com"
      + subject        = "repo:Altinn/altinn-notifications:environment:at25"
    }

  # azuread_application_federated_identity_credential.oidc_environments["pac-altinn-altinn-notifications-dev-dev"] will be created
  + resource "azuread_application_federated_identity_credential" "oidc_environments" {
      + application_id = (known after apply)
      + audiences      = [
          + "api://AzureADTokenExchange",
        ]
      + credential_id  = (known after apply)
      + description    = "Allow GitHub actions run within the context of environment 'dev' from the repository https://github.com/Altinn/altinn-notifications to have access to the app registration"
      + display_name   = "github.Altinn.altinn-notifications.environment.dev"
      + id             = (known after apply)
      + issuer         = "https://token.actions.githubusercontent.com"
      + subject        = "repo:Altinn/altinn-notifications:environment:dev"
    }

  # azuread_application_federated_identity_credential.oidc_environments["pac-altinn-altinn-notifications-dev-grafana"] will be created
  + resource "azuread_application_federated_identity_credential" "oidc_environments" {
      + application_id = (known after apply)
      + audiences      = [
          + "api://AzureADTokenExchange",
        ]
      + credential_id  = (known after apply)
      + description    = "Allow GitHub actions run within the context of environment 'grafana' from the repository https://github.com/Altinn/altinn-notifications to have access to the app registration"
      + display_name   = "github.Altinn.altinn-notifications.environment.grafana"
      + id             = (known after apply)
      + issuer         = "https://token.actions.githubusercontent.com"
      + subject        = "repo:Altinn/altinn-notifications:environment:grafana"
    }

  # azuread_application_federated_identity_credential.oidc_environments["pac-altinn-altinn-notifications-dev-test"] will be created
  + resource "azuread_application_federated_identity_credential" "oidc_environments" {
      + application_id = (known after apply)
      + audiences      = [
          + "api://AzureADTokenExchange",
        ]
      + credential_id  = (known after apply)
      + description    = "Allow GitHub actions run within the context of environment 'test' from the repository https://github.com/Altinn/altinn-notifications to have access to the app registration"
      + display_name   = "github.Altinn.altinn-notifications.environment.test"
      + id             = (known after apply)
      + issuer         = "https://token.actions.githubusercontent.com"
      + subject        = "repo:Altinn/altinn-notifications:environment:test"
    }

  # azuread_application_federated_identity_credential.oidc_environments["pac-altinn-altinn-notifications-dev-yt01"] will be created
  + resource "azuread_application_federated_identity_credential" "oidc_environments" {
      + application_id = (known after apply)
      + audiences      = [
          + "api://AzureADTokenExchange",
        ]
      + credential_id  = (known after apply)
      + description    = "Allow GitHub actions run within the context of environment 'yt01' from the repository https://github.com/Altinn/altinn-notifications to have access to the app registration"
      + display_name   = "github.Altinn.altinn-notifications.environment.yt01"
      + id             = (known after apply)
      + issuer         = "https://token.actions.githubusercontent.com"
      + subject        = "repo:Altinn/altinn-notifications:environment:yt01"
    }

  # azuread_application_federated_identity_credential.oidc_environments["pac-altinn-altinn-notifications-prod-prod"] will be created
  + resource "azuread_application_federated_identity_credential" "oidc_environments" {
      + application_id = (known after apply)
      + audiences      = [
          + "api://AzureADTokenExchange",
        ]
      + credential_id  = (known after apply)
      + description    = "Allow GitHub actions run within the context of environment 'prod' from the repository https://github.com/Altinn/altinn-notifications to have access to the app registration"
      + display_name   = "github.Altinn.altinn-notifications.environment.prod"
      + id             = (known after apply)
      + issuer         = "https://token.actions.githubusercontent.com"
      + subject        = "repo:Altinn/altinn-notifications:environment:prod"
    }

  # azuread_application_federated_identity_credential.oidc_environments["pac-altinn-altinn-notifications-prod-staging"] will be created
  + resource "azuread_application_federated_identity_credential" "oidc_environments" {
      + application_id = (known after apply)
      + audiences      = [
          + "api://AzureADTokenExchange",
        ]
      + credential_id  = (known after apply)
      + description    = "Allow GitHub actions run within the context of environment 'staging' from the repository https://github.com/Altinn/altinn-notifications to have access to the app registration"
      + display_name   = "github.Altinn.altinn-notifications.environment.staging"
      + id             = (known after apply)
      + issuer         = "https://token.actions.githubusercontent.com"
      + subject        = "repo:Altinn/altinn-notifications:environment:staging"
    }

  # azuread_application_federated_identity_credential.oidc_environments["pac-altinn-altinn-notifications-prod-tt02"] will be created
  + resource "azuread_application_federated_identity_credential" "oidc_environments" {
      + application_id = (known after apply)
      + audiences      = [
          + "api://AzureADTokenExchange",
        ]
      + credential_id  = (known after apply)
      + description    = "Allow GitHub actions run within the context of environment 'tt02' from the repository https://github.com/Altinn/altinn-notifications to have access to the app registration"
      + display_name   = "github.Altinn.altinn-notifications.environment.tt02"
      + id             = (known after apply)
      + issuer         = "https://token.actions.githubusercontent.com"
      + subject        = "repo:Altinn/altinn-notifications:environment:tt02"
    }

  # azuread_application_federated_identity_credential.oidc_environments["pac-altinn-altinn-receipt-dev-at21"] must be replaced
-/+ resource "azuread_application_federated_identity_credential" "oidc_environments" {
      ~ credential_id  = "eba0de9c-27e7-4f44-8823-5604ccd08566" -> (known after apply)
      ~ description    = "Allow GitHub actions run within the context of environment 'at21' from the repository https://github.com/altinn/altinn-receipt to have access to the app registration" -> "Allow GitHub actions run within the context of environment 'at21' from the repository https://github.com/Altinn/altinn-receipt to have access to the app registration"
      ~ display_name   = "github.altinn.altinn-receipt.environment.at21" -> "github.Altinn.altinn-receipt.environment.at21" # forces replacement
      ~ id             = "a9890518-647e-4298-ba54-3aa86ffb0fb5/federatedIdentityCredential/eba0de9c-27e7-4f44-8823-5604ccd08566" -> (known after apply)
      ~ subject        = "repo:altinn/altinn-receipt:environment:at21" -> "repo:Altinn/altinn-receipt:environment:at21"
        # (3 unchanged attributes hidden)
    }

  # azuread_application_federated_identity_credential.oidc_environments["pac-altinn-altinn-receipt-dev-at22"] must be replaced
-/+ resource "azuread_application_federated_identity_credential" "oidc_environments" {
      ~ credential_id  = "d383c7da-ed10-42cf-8227-c44b7aed4698" -> (known after apply)
      ~ description    = "Allow GitHub actions run within the context of environment 'at22' from the repository https://github.com/altinn/altinn-receipt to have access to the app registration" -> "Allow GitHub actions run within the context of environment 'at22' from the repository https://github.com/Altinn/altinn-receipt to have access to the app registration"
      ~ display_name   = "github.altinn.altinn-receipt.environment.at22" -> "github.Altinn.altinn-receipt.environment.at22" # forces replacement
      ~ id             = "a9890518-647e-4298-ba54-3aa86ffb0fb5/federatedIdentityCredential/d383c7da-ed10-42cf-8227-c44b7aed4698" -> (known after apply)
      ~ subject        = "repo:altinn/altinn-receipt:environment:at22" -> "repo:Altinn/altinn-receipt:environment:at22"
        # (3 unchanged attributes hidden)
    }

  # azuread_application_federated_identity_credential.oidc_environments["pac-altinn-altinn-receipt-dev-at23"] must be replaced
-/+ resource "azuread_application_federated_identity_credential" "oidc_environments" {
      ~ credential_id  = "a638c7b2-7b72-4a1c-ae84-df34d6b0aa20" -> (known after apply)
      ~ description    = "Allow GitHub actions run within the context of environment 'at23' from the repository https://github.com/altinn/altinn-receipt to have access to the app registration" -> "Allow GitHub actions run within the context of environment 'at23' from the repository https://github.com/Altinn/altinn-receipt to have access to the app registration"
      ~ display_name   = "github.altinn.altinn-receipt.environment.at23" -> "github.Altinn.altinn-receipt.environment.at23" # forces replacement
      ~ id             = "a9890518-647e-4298-ba54-3aa86ffb0fb5/federatedIdentityCredential/a638c7b2-7b72-4a1c-ae84-df34d6b0aa20" -> (known after apply)
      ~ subject        = "repo:altinn/altinn-receipt:environment:at23" -> "repo:Altinn/altinn-receipt:environment:at23"
        # (3 unchanged attributes hidden)
    }

  # azuread_application_federated_identity_credential.oidc_environments["pac-altinn-altinn-receipt-dev-at24"] must be replaced
-/+ resource "azuread_application_federated_identity_credential" "oidc_environments" {
      ~ credential_id  = "e665981d-3b17-4cc0-adc2-8cb4a055c934" -> (known after apply)
      ~ description    = "Allow GitHub actions run within the context of environment 'at24' from the repository https://github.com/altinn/altinn-receipt to have access to the app registration" -> "Allow GitHub actions run within the context of environment 'at24' from the repository https://github.com/Altinn/altinn-receipt to have access to the app registration"
      ~ display_name   = "github.altinn.altinn-receipt.environment.at24" -> "github.Altinn.altinn-receipt.environment.at24" # forces replacement
      ~ id             = "a9890518-647e-4298-ba54-3aa86ffb0fb5/federatedIdentityCredential/e665981d-3b17-4cc0-adc2-8cb4a055c934" -> (known after apply)
      ~ subject        = "repo:altinn/altinn-receipt:environment:at24" -> "repo:Altinn/altinn-receipt:environment:at24"
        # (3 unchanged attributes hidden)
    }

  # azuread_application_federated_identity_credential.oidc_environments["pac-altinn-altinn-receipt-dev-at25"] must be replaced
-/+ resource "azuread_application_federated_identity_credential" "oidc_environments" {
      ~ credential_id  = "bac4d56f-22bd-48b1-98ad-8e6cbf5b35c7" -> (known after apply)
      ~ description    = "Allow GitHub actions run within the context of environment 'at25' from the repository https://github.com/altinn/altinn-receipt to have access to the app registration" -> "Allow GitHub actions run within the context of environment 'at25' from the repository https://github.com/Altinn/altinn-receipt to have access to the app registration"
      ~ display_name   = "github.altinn.altinn-receipt.environment.at25" -> "github.Altinn.altinn-receipt.environment.at25" # forces replacement
      ~ id             = "a9890518-647e-4298-ba54-3aa86ffb0fb5/federatedIdentityCredential/bac4d56f-22bd-48b1-98ad-8e6cbf5b35c7" -> (known after apply)
      ~ subject        = "repo:altinn/altinn-receipt:environment:at25" -> "repo:Altinn/altinn-receipt:environment:at25"
        # (3 unchanged attributes hidden)
    }

  # azuread_application_federated_identity_credential.oidc_environments["pac-altinn-altinn-receipt-dev-dev"] must be replaced
-/+ resource "azuread_application_federated_identity_credential" "oidc_environments" {
      ~ credential_id  = "0da39b99-95a7-4b66-8df1-1b63a75ea896" -> (known after apply)
      ~ description    = "Allow GitHub actions run within the context of environment 'dev' from the repository https://github.com/altinn/altinn-receipt to have access to the app registration" -> "Allow GitHub actions run within the context of environment 'dev' from the repository https://github.com/Altinn/altinn-receipt to have access to the app registration"
      ~ display_name   = "github.altinn.altinn-receipt.environment.dev" -> "github.Altinn.altinn-receipt.environment.dev" # forces replacement
      ~ id             = "a9890518-647e-4298-ba54-3aa86ffb0fb5/federatedIdentityCredential/0da39b99-95a7-4b66-8df1-1b63a75ea896" -> (known after apply)
      ~ subject        = "repo:altinn/altinn-receipt:environment:dev" -> "repo:Altinn/altinn-receipt:environment:dev"
        # (3 unchanged attributes hidden)
    }

  # azuread_application_federated_identity_credential.oidc_environments["pac-altinn-altinn-receipt-dev-grafana"] must be replaced
-/+ resource "azuread_application_federated_identity_credential" "oidc_environments" {
      ~ credential_id  = "4968ef08-99f1-4ea5-a0d0-6b7cd84a47ad" -> (known after apply)
      ~ description    = "Allow GitHub actions run within the context of environment 'grafana' from the repository https://github.com/altinn/altinn-receipt to have access to the app registration" -> "Allow GitHub actions run within the context of environment 'grafana' from the repository https://github.com/Altinn/altinn-receipt to have access to the app registration"
      ~ display_name   = "github.altinn.altinn-receipt.environment.grafana" -> "github.Altinn.altinn-receipt.environment.grafana" # forces replacement
      ~ id             = "a9890518-647e-4298-ba54-3aa86ffb0fb5/federatedIdentityCredential/4968ef08-99f1-4ea5-a0d0-6b7cd84a47ad" -> (known after apply)
      ~ subject        = "repo:altinn/altinn-receipt:environment:grafana" -> "repo:Altinn/altinn-receipt:environment:grafana"
        # (3 unchanged attributes hidden)
    }

  # azuread_application_federated_identity_credential.oidc_environments["pac-altinn-altinn-receipt-dev-test"] must be replaced
-/+ resource "azuread_application_federated_identity_credential" "oidc_environments" {
      ~ credential_id  = "2fc1d3de-8a98-491e-9922-e0a4ff628ee7" -> (known after apply)
      ~ description    = "Allow GitHub actions run within the context of environment 'test' from the repository https://github.com/altinn/altinn-receipt to have access to the app registration" -> "Allow GitHub actions run within the context of environment 'test' from the repository https://github.com/Altinn/altinn-receipt to have access to the app registration"
      ~ display_name   = "github.altinn.altinn-receipt.environment.test" -> "github.Altinn.altinn-receipt.environment.test" # forces replacement
      ~ id             = "a9890518-647e-4298-ba54-3aa86ffb0fb5/federatedIdentityCredential/2fc1d3de-8a98-491e-9922-e0a4ff628ee7" -> (known after apply)
      ~ subject        = "repo:altinn/altinn-receipt:environment:test" -> "repo:Altinn/altinn-receipt:environment:test"
        # (3 unchanged attributes hidden)
    }

  # azuread_application_federated_identity_credential.oidc_environments["pac-altinn-altinn-receipt-dev-yt01"] must be replaced
-/+ resource "azuread_application_federated_identity_credential" "oidc_environments" {
      ~ credential_id  = "43acc0ed-9fbe-4604-b962-5db09553a960" -> (known after apply)
      ~ description    = "Allow GitHub actions run within the context of environment 'yt01' from the repository https://github.com/altinn/altinn-receipt to have access to the app registration" -> "Allow GitHub actions run within the context of environment 'yt01' from the repository https://github.com/Altinn/altinn-receipt to have access to the app registration"
      ~ display_name   = "github.altinn.altinn-receipt.environment.yt01" -> "github.Altinn.altinn-receipt.environment.yt01" # forces replacement
      ~ id             = "a9890518-647e-4298-ba54-3aa86ffb0fb5/federatedIdentityCredential/43acc0ed-9fbe-4604-b962-5db09553a960" -> (known after apply)
      ~ subject        = "repo:altinn/altinn-receipt:environment:yt01" -> "repo:Altinn/altinn-receipt:environment:yt01"
        # (3 unchanged attributes hidden)
    }

  # azuread_application_federated_identity_credential.oidc_environments["pac-altinn-altinn-receipt-prod-prod"] must be replaced
-/+ resource "azuread_application_federated_identity_credential" "oidc_environments" {
      ~ credential_id  = "1fbb6721-eab1-47cf-9c8d-2c943b2ac56a" -> (known after apply)
      ~ description    = "Allow GitHub actions run within the context of environment 'prod' from the repository https://github.com/altinn/altinn-receipt to have access to the app registration" -> "Allow GitHub actions run within the context of environment 'prod' from the repository https://github.com/Altinn/altinn-receipt to have access to the app registration"
      ~ display_name   = "github.altinn.altinn-receipt.environment.prod" -> "github.Altinn.altinn-receipt.environment.prod" # forces replacement
      ~ id             = "fe5b68b8-d39c-4672-9797-6d02aa556647/federatedIdentityCredential/1fbb6721-eab1-47cf-9c8d-2c943b2ac56a" -> (known after apply)
      ~ subject        = "repo:altinn/altinn-receipt:environment:prod" -> "repo:Altinn/altinn-receipt:environment:prod"
        # (3 unchanged attributes hidden)
    }

  # azuread_application_federated_identity_credential.oidc_environments["pac-altinn-altinn-receipt-prod-staging"] must be replaced
-/+ resource "azuread_application_federated_identity_credential" "oidc_environments" {
      ~ credential_id  = "f0ef1d4d-0d13-4eb8-bffa-0810a1a9fba7" -> (known after apply)
      ~ description    = "Allow GitHub actions run within the context of environment 'staging' from the repository https://github.com/altinn/altinn-receipt to have access to the app registration" -> "Allow GitHub actions run within the context of environment 'staging' from the repository https://github.com/Altinn/altinn-receipt to have access to the app registration"
      ~ display_name   = "github.altinn.altinn-receipt.environment.staging" -> "github.Altinn.altinn-receipt.environment.staging" # forces replacement
      ~ id             = "fe5b68b8-d39c-4672-9797-6d02aa556647/federatedIdentityCredential/f0ef1d4d-0d13-4eb8-bffa-0810a1a9fba7" -> (known after apply)
      ~ subject        = "repo:altinn/altinn-receipt:environment:staging" -> "repo:Altinn/altinn-receipt:environment:staging"
        # (3 unchanged attributes hidden)
    }

  # azuread_application_federated_identity_credential.oidc_environments["pac-altinn-altinn-receipt-prod-tt02"] must be replaced
-/+ resource "azuread_application_federated_identity_credential" "oidc_environments" {
      ~ credential_id  = "82b48996-4ae7-4c39-990d-62529f1a86ca" -> (known after apply)
      ~ description    = "Allow GitHub actions run within the context of environment 'tt02' from the repository https://github.com/altinn/altinn-receipt to have access to the app registration" -> "Allow GitHub actions run within the context of environment 'tt02' from the repository https://github.com/Altinn/altinn-receipt to have access to the app registration"
      ~ display_name   = "github.altinn.altinn-receipt.environment.tt02" -> "github.Altinn.altinn-receipt.environment.tt02" # forces replacement
      ~ id             = "fe5b68b8-d39c-4672-9797-6d02aa556647/federatedIdentityCredential/82b48996-4ae7-4c39-990d-62529f1a86ca" -> (known after apply)
      ~ subject        = "repo:altinn/altinn-receipt:environment:tt02" -> "repo:Altinn/altinn-receipt:environment:tt02"
        # (3 unchanged attributes hidden)
    }

  # azuread_service_principal.product["pac-altinn-altinn-notifications-dev"] will be created
  + resource "azuread_service_principal" "product" {
      + account_enabled             = true
      + app_role_ids                = (known after apply)
      + app_roles                   = (known after apply)
      + application_tenant_id       = (known after apply)
      + client_id                   = (known after apply)
      + display_name                = (known after apply)
      + homepage_url                = (known after apply)
      + id                          = (known after apply)
      + logout_url                  = (known after apply)
      + oauth2_permission_scope_ids = (known after apply)
      + oauth2_permission_scopes    = (known after apply)
      + object_id                   = (known after apply)
      + redirect_uris               = (known after apply)
      + saml_metadata_url           = (known after apply)
      + service_principal_names     = (known after apply)
      + sign_in_audience            = (known after apply)
      + tags                        = (known after apply)
      + type                        = (known after apply)
    }

  # azuread_service_principal.product["pac-altinn-altinn-notifications-prod"] will be created
  + resource "azuread_service_principal" "product" {
      + account_enabled             = true
      + app_role_ids                = (known after apply)
      + app_roles                   = (known after apply)
      + application_tenant_id       = (known after apply)
      + client_id                   = (known after apply)
      + display_name                = (known after apply)
      + homepage_url                = (known after apply)
      + id                          = (known after apply)
      + logout_url                  = (known after apply)
      + oauth2_permission_scope_ids = (known after apply)
      + oauth2_permission_scopes    = (known after apply)
      + object_id                   = (known after apply)
      + redirect_uris               = (known after apply)
      + saml_metadata_url           = (known after apply)
      + service_principal_names     = (known after apply)
      + sign_in_audience            = (known after apply)
      + tags                        = (known after apply)
      + type                        = (known after apply)
    }

  # azurerm_app_configuration.state will be updated in-place
  ~ resource "azurerm_app_configuration" "state" {
        id                                               = "/subscriptions/d43d5057-8389-40d5-88c4-04db9275cbf2/resourceGroups/terraform-rg/providers/Microsoft.AppConfiguration/configurationStores/altinnterraformappconf02"
        name                                             = "altinnterraformappconf02"
      ~ tags                                             = {
          - "costcenter" = "altinn3"
          - "createdAt"  = "09-07-2024 09:55:43 UTC"
          - "createdBy"  = "Bengt Rino Fredh"
          - "modifiedAt" = "24-02-2025 09:32:04 UTC"
          - "modifiedBy" = "GitHub: Altinn/altinn-platform - Reader"
          - "repository" = "github.com/Altinn/altinn-platform"
          - "solution"   = "platform"
        } -> (known after apply)
        # (13 unchanged attributes hidden)
    }

  # azurerm_role_assignment.appregg["pac-altinn-altinn-notifications-dev"] will be created
  + resource "azurerm_role_assignment" "appregg" {
      + condition                        = <<-EOT
            (
             (
              !(ActionMatches{'Microsoft.Storage/storageAccounts/blobServices/containers/blobs/write'})
              AND
              !(ActionMatches{'Microsoft.Storage/storageAccounts/blobServices/containers/blobs/add/action'})
              AND
              !(ActionMatches{'Microsoft.Storage/storageAccounts/blobServices/containers/blobs/runAsSuperUser/action'})
              AND
              !(ActionMatches{'Microsoft.Storage/storageAccounts/blobServices/containers/blobs/tags/write'})
              AND
              !(ActionMatches{'Microsoft.Storage/storageAccounts/blobServices/containers/blobs/delete'})
              AND
              !(ActionMatches{'Microsoft.Storage/storageAccounts/blobServices/containers/blobs/deleteBlobVersion/action'})
              AND
              !(ActionMatches{'Microsoft.Storage/storageAccounts/blobServices/containers/blobs/immutableStorage/runAsSuperUser/action'})
              AND
              !(ActionMatches{'Microsoft.Storage/storageAccounts/blobServices/containers/blobs/move/action'})
              AND
              !(ActionMatches{'Microsoft.Storage/storageAccounts/blobServices/containers/blobs/manageOwnership/action'})
              AND
              !(ActionMatches{'Microsoft.Storage/storageAccounts/blobServices/containers/blobs/permanentDelete/action'})
              AND
              !(ActionMatches{'Microsoft.Storage/storageAccounts/blobServices/containers/blobs/modifyPermissions/action'})
            )
            
             OR
             (
              
              @Resource[Microsoft.Storage/storageAccounts/blobServices/containers/blobs:path] StringStartsWith 'github.com/altinn/altinn-notifications/environments/dev'
              OR
              
              @Resource[Microsoft.Storage/storageAccounts/blobServices/containers/blobs:path] StringStartsWith 'github.com/altinn/altinn-notifications/environments/test'
              OR
              
              @Resource[Microsoft.Storage/storageAccounts/blobServices/containers/blobs:path] StringStartsWith 'github.com/altinn/altinn-notifications/environments/at21'
              OR
              
              @Resource[Microsoft.Storage/storageAccounts/blobServices/containers/blobs:path] StringStartsWith 'github.com/altinn/altinn-notifications/environments/at22'
              OR
              
              @Resource[Microsoft.Storage/storageAccounts/blobServices/containers/blobs:path] StringStartsWith 'github.com/altinn/altinn-notifications/environments/at23'
              OR
              
              @Resource[Microsoft.Storage/storageAccounts/blobServices/containers/blobs:path] StringStartsWith 'github.com/altinn/altinn-notifications/environments/at24'
              OR
              
              @Resource[Microsoft.Storage/storageAccounts/blobServices/containers/blobs:path] StringStartsWith 'github.com/altinn/altinn-notifications/environments/at25'
              OR
              
              @Resource[Microsoft.Storage/storageAccounts/blobServices/containers/blobs:path] StringStartsWith 'github.com/altinn/altinn-notifications/environments/yt01'
              OR
              
              @Resource[Microsoft.Storage/storageAccounts/blobServices/containers/blobs:path] StringStartsWith 'github.com/altinn/altinn-notifications/environments/grafana'
              OR
                  @Resource[Microsoft.Storage/storageAccounts/blobServices/containers/blobs:path] StringStartsWith 'github.com/altinn/~/EOT'
             )
            )
        EOT
      + condition_version                = "2.0"
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Storage Blob Data Owner"
      + scope                            = "/subscriptions/d43d5057-8389-40d5-88c4-04db9275cbf2/resourceGroups/terraform-rg/providers/Microsoft.Storage/storageAccounts/altinnterraformstorage02/blobServices/default/containers/tfstates"
      + skip_service_principal_aad_check = true
    }

  # azurerm_role_assignment.appregg["pac-altinn-altinn-notifications-prod"] will be created
  + resource "azurerm_role_assignment" "appregg" {
      + condition                        = <<-EOT
            (
             (
              !(ActionMatches{'Microsoft.Storage/storageAccounts/blobServices/containers/blobs/write'})
              AND
              !(ActionMatches{'Microsoft.Storage/storageAccounts/blobServices/containers/blobs/add/action'})
              AND
              !(ActionMatches{'Microsoft.Storage/storageAccounts/blobServices/containers/blobs/runAsSuperUser/action'})
              AND
              !(ActionMatches{'Microsoft.Storage/storageAccounts/blobServices/containers/blobs/tags/write'})
              AND
              !(ActionMatches{'Microsoft.Storage/storageAccounts/blobServices/containers/blobs/delete'})
              AND
              !(ActionMatches{'Microsoft.Storage/storageAccounts/blobServices/containers/blobs/deleteBlobVersion/action'})
              AND
              !(ActionMatches{'Microsoft.Storage/storageAccounts/blobServices/containers/blobs/immutableStorage/runAsSuperUser/action'})
              AND
              !(ActionMatches{'Microsoft.Storage/storageAccounts/blobServices/containers/blobs/move/action'})
              AND
              !(ActionMatches{'Microsoft.Storage/storageAccounts/blobServices/containers/blobs/manageOwnership/action'})
              AND
              !(ActionMatches{'Microsoft.Storage/storageAccounts/blobServices/containers/blobs/permanentDelete/action'})
              AND
              !(ActionMatches{'Microsoft.Storage/storageAccounts/blobServices/containers/blobs/modifyPermissions/action'})
            )
            
             OR
             (
              
              @Resource[Microsoft.Storage/storageAccounts/blobServices/containers/blobs:path] StringStartsWith 'github.com/altinn/altinn-notifications/environments/staging'
              OR
              
              @Resource[Microsoft.Storage/storageAccounts/blobServices/containers/blobs:path] StringStartsWith 'github.com/altinn/altinn-notifications/environments/tt02'
              OR
              
              @Resource[Microsoft.Storage/storageAccounts/blobServices/containers/blobs:path] StringStartsWith 'github.com/altinn/altinn-notifications/environments/prod'
              OR
                  @Resource[Microsoft.Storage/storageAccounts/blobServices/containers/blobs:path] StringStartsWith 'github.com/altinn/~/EOT'
             )
            )
        EOT
      + condition_version                = "2.0"
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Storage Blob Data Owner"
      + scope                            = "/subscriptions/d43d5057-8389-40d5-88c4-04db9275cbf2/resourceGroups/terraform-rg/providers/Microsoft.Storage/storageAccounts/altinnterraformstorage02/blobServices/default/containers/tfstates"
      + skip_service_principal_aad_check = true
    }

  # azurerm_role_assignment.apps_contributor["pac-altinn-altinn-notifications-dev"] will be created
  + resource "azurerm_role_assignment" "apps_contributor" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Contributor"
      + scope                            = "/providers/Microsoft.Management/managementGroups/PAC-Dev"
      + skip_service_principal_aad_check = true
    }

  # azurerm_role_assignment.apps_contributor["pac-altinn-altinn-notifications-prod"] will be created
  + resource "azurerm_role_assignment" "apps_contributor" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Contributor"
      + scope                            = "/providers/Microsoft.Management/managementGroups/PAC-Prod"
      + skip_service_principal_aad_check = true
    }

  # azurerm_role_assignment.apps_user_access_administrator["pac-altinn-altinn-notifications-dev"] will be created
  + resource "azurerm_role_assignment" "apps_user_access_administrator" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "User Access Administrator"
      + scope                            = "/providers/Microsoft.Management/managementGroups/PAC-Dev"
      + skip_service_principal_aad_check = true
    }

  # azurerm_role_assignment.apps_user_access_administrator["pac-altinn-altinn-notifications-prod"] will be created
  + resource "azurerm_role_assignment" "apps_user_access_administrator" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "User Access Administrator"
      + scope                            = "/providers/Microsoft.Management/managementGroups/PAC-Prod"
      + skip_service_principal_aad_check = true
    }

  # azurerm_role_assignment.products["pac-dev"] must be replaced
-/+ resource "azurerm_role_assignment" "products" {
      ~ condition                        = <<-EOT # forces replacement
            (
              (
              !(ActionMatches{'Microsoft.Storage/storageAccounts/blobServices/containers/blobs/write'})
              AND
              !(ActionMatches{'Microsoft.Storage/storageAccounts/blobServices/containers/blobs/add/action'})
              AND
              !(ActionMatches{'Microsoft.Storage/storageAccounts/blobServices/containers/blobs/runAsSuperUser/action'})
              AND
              !(ActionMatches{'Microsoft.Storage/storageAccounts/blobServices/containers/blobs/tags/write'})
              AND
              !(ActionMatches{'Microsoft.Storage/storageAccounts/blobServices/containers/blobs/delete'})
              AND
              !(ActionMatches{'Microsoft.Storage/storageAccounts/blobServices/containers/blobs/deleteBlobVersion/action'})
              AND
              !(ActionMatches{'Microsoft.Storage/storageAccounts/blobServices/containers/blobs/immutableStorage/runAsSuperUser/action'})
              AND
              !(ActionMatches{'Microsoft.Storage/storageAccounts/blobServices/containers/blobs/move/action'})
              AND
              !(ActionMatches{'Microsoft.Storage/storageAccounts/blobServices/containers/blobs/manageOwnership/action'})
              AND
              !(ActionMatches{'Microsoft.Storage/storageAccounts/blobServices/containers/blobs/permanentDelete/action'})
              AND
              !(ActionMatches{'Microsoft.Storage/storageAccounts/blobServices/containers/blobs/modifyPermissions/action'})
            )
            
              OR
              (
                
                  @Resource[Microsoft.Storage/storageAccounts/blobServices/containers/blobs:path] StringStartsWith 'github.com/altinn/altinn-receipt'
                  OR
          +     
          +       @Resource[Microsoft.Storage/storageAccounts/blobServices/containers/blobs:path] StringStartsWith 'github.com/altinn/altinn-notifications'
          +       OR
                      @Resource[Microsoft.Storage/storageAccounts/blobServices/containers/blobs:path] StringStartsWith 'github.com/altinn/~/EOT'
              )
            )
        EOT
      ~ id                               = "/subscriptions/d43d5057-8389-40d5-88c4-04db9275cbf2/resourceGroups/terraform-rg/providers/Microsoft.Storage/storageAccounts/altinnterraformstorage02/blobServices/default/containers/tfstates/providers/Microsoft.Authorization/roleAssignments/1c43358c-369c-f91a-81c2-cd4ff1179e60" -> (known after apply)
      ~ name                             = "1c43358c-369c-f91a-81c2-cd4ff1179e60" -> (known after apply)
      ~ principal_type                   = "Group" -> (known after apply)
      ~ role_definition_id               = "/subscriptions/d43d5057-8389-40d5-88c4-04db9275cbf2/providers/Microsoft.Authorization/roleDefinitions/b7e6dc6d-f1e8-4753-8033-0f276bb0955b" -> (known after apply)
      + skip_service_principal_aad_check = (known after apply)
        # (4 unchanged attributes hidden)
    }

  # azurerm_role_assignment.products["pac-prod"] must be replaced
-/+ resource "azurerm_role_assignment" "products" {
      ~ condition                        = <<-EOT # forces replacement
            (
              (
              !(ActionMatches{'Microsoft.Storage/storageAccounts/blobServices/containers/blobs/write'})
              AND
              !(ActionMatches{'Microsoft.Storage/storageAccounts/blobServices/containers/blobs/add/action'})
              AND
              !(ActionMatches{'Microsoft.Storage/storageAccounts/blobServices/containers/blobs/runAsSuperUser/action'})
              AND
              !(ActionMatches{'Microsoft.Storage/storageAccounts/blobServices/containers/blobs/tags/write'})
              AND
              !(ActionMatches{'Microsoft.Storage/storageAccounts/blobServices/containers/blobs/delete'})
              AND
              !(ActionMatches{'Microsoft.Storage/storageAccounts/blobServices/containers/blobs/deleteBlobVersion/action'})
              AND
              !(ActionMatches{'Microsoft.Storage/storageAccounts/blobServices/containers/blobs/immutableStorage/runAsSuperUser/action'})
              AND
              !(ActionMatches{'Microsoft.Storage/storageAccounts/blobServices/containers/blobs/move/action'})
              AND
              !(ActionMatches{'Microsoft.Storage/storageAccounts/blobServices/containers/blobs/manageOwnership/action'})
              AND
              !(ActionMatches{'Microsoft.Storage/storageAccounts/blobServices/containers/blobs/permanentDelete/action'})
              AND
              !(ActionMatches{'Microsoft.Storage/storageAccounts/blobServices/containers/blobs/modifyPermissions/action'})
            )
            
              OR
              (
                
                  @Resource[Microsoft.Storage/storageAccounts/blobServices/containers/blobs:path] StringStartsWith 'github.com/altinn/altinn-receipt'
                  OR
          +     
          +       @Resource[Microsoft.Storage/storageAccounts/blobServices/containers/blobs:path] StringStartsWith 'github.com/altinn/altinn-notifications'
          +       OR
                      @Resource[Microsoft.Storage/storageAccounts/blobServices/containers/blobs:path] StringStartsWith 'github.com/altinn/~/EOT'
              )
            )
        EOT
      ~ id                               = "/subscriptions/d43d5057-8389-40d5-88c4-04db9275cbf2/resourceGroups/terraform-rg/providers/Microsoft.Storage/storageAccounts/altinnterraformstorage02/blobServices/default/containers/tfstates/providers/Microsoft.Authorization/roleAssignments/a2083b3b-fc37-bd9d-a9a6-51f4f775410c" -> (known after apply)
      ~ name                             = "a2083b3b-fc37-bd9d-a9a6-51f4f775410c" -> (known after apply)
      ~ principal_type                   = "Group" -> (known after apply)
      ~ role_definition_id               = "/subscriptions/d43d5057-8389-40d5-88c4-04db9275cbf2/providers/Microsoft.Authorization/roleDefinitions/b7e6dc6d-f1e8-4753-8033-0f276bb0955b" -> (known after apply)
      + skip_service_principal_aad_check = (known after apply)
        # (4 unchanged attributes hidden)
    }

  # azurerm_storage_account.backend will be updated in-place
  ~ resource "azurerm_storage_account" "backend" {
        id                                = "/subscriptions/d43d5057-8389-40d5-88c4-04db9275cbf2/resourceGroups/terraform-rg/providers/Microsoft.Storage/storageAccounts/altinnterraformstorage02"
        name                              = "altinnterraformstorage02"
      ~ tags                              = {
          - "costcenter" = "altinn3"
          - "createdAt"  = "09-07-2024 09:55:43 UTC"
          - "createdBy"  = "Bengt Rino Fredh"
          - "modifiedAt" = "24-02-2025 09:32:04 UTC"
          - "modifiedBy" = "GitHub: Altinn/altinn-platform - Reader"
          - "repository" = "github.com/Altinn/altinn-platform"
          - "solution"   = "platform"
        } -> (known after apply)
        # (35 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

Plan: 41 to add, 3 to change, 16 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan.out

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan.out"
Releasing state lock. This may take a few moments...

```

</details>

| Context | Values |
| - | - |
| Pusher | @monteiro-renato |
| Action | `pull_request` |
| Working Directory | `./infrastructure/products` |
| State File | `github.com/altinn/altinn-platform/environments/prod/products.tfstate` |
| Plan File | `github.com_altinn_altinn-platform_environments_prod_products.tfstate.tfplan`